Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.PathPointsAreTooClose(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Document,System.Double)
Returns true if the two points are too close to be adjacent start, end or waypoints in a PathOfTravel.
Remarks:
The points are too close when the distance between them is closer than the length
specified by MinimumLength plus a certain tolerance.
cda:
The document for which to compare the two points.
tolerance:
The tolerance to add to the minimum distance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.IsLargeGeometryAllowed
Returns if large geometry is allowed for path of travel creation or not.
Remarks:
The return value is based off the current setting for the AllowLargeGeometry Property as follows:
If it is set to Prompt, then prompts the user to continue or not, if no ui is present, returns false.If it is set to DisAllaow, returns false.If it is set to Allow, returns true.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.SetIgnoredCategoryIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the ElementIds for Category elements which are ignored by route calculation.
categoryIds:
The ids of Categories to be ignored by route calculation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in categoryIds are not valid Category element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetExcludedCategoryIds
Returns ElementIds for Category elements which are excluded (not taken into account) by route calculation.
These categories are always excluded, regardless of the Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds value.
If an excluded category has sub-categories, then the sub-categories will be excluded as well.
Returns:
The ids of Categories which are excluded by route calculation.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetIgnoredCategoryIds
Returns ElementIds for Category elements which are ignored (not taken into account) route calculation.
To enable ignoring of these categories, Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds must be set to true.
If an ignored category has sub-categories, then the sub-categories will be ignored as well.
Returns:
The ids of Categories which are ignored by route calculation. By default, the set contains the Doors Category.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetRouteAnalysisSettings(Autodesk.Revit.DB.Document)
Returns the RouteAnalysisSettings element for a given document.
Remarks:
Project documents have a RouteAnalysisSettings element, one per document.
Family documents do not have RouteAnalysisSettings elements.
cda:
The document for which to get the RouteAnalysisSettings element.
Returns:
Returns the RouteAnalysisSettings element in project documents
or null for family documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.TravelSpeed
The average speed that people will be traveling along the created path of travel. Default value is 4.4 ft/s (3 mph)
Remarks:
The speed value is stored in terms of Revit internal SI Units, which is feet per second.
To convert between desired and internal units Autodesk::Revit::DB::UnitUtils.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.MinimumLength
The constant storing minimum allowed length of path of travel
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.AnalysisZoneTopOffset
The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
Remarks:
The zone's top plane elevation is different per plan view
and is determined by adding the top offset to the view's level elevation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for topOffset must be non-negative.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.AnalysisZoneBottomOffset
The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
Remarks:
The zone's bottom plane elevation is different per plan view
and is determined by adding the bottom offset to the view's level elevation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for bottomOffset must be non-negative.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.IgnoreImports
If true, import instances are ignored by route calculation.
For imports to be ignored, also Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds must be set to true.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.EnableIgnoredCategoryIds
When this setting is true, elements with category ids returned by
GetIgnoredCategoryIds will be ignored in route calculation.
default is true as all elements with the Door Category Id are ignored by default.
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings
RouteAnalysisSettings is an element which contains project-wide settings for route calculations.
The PathOfTravel element uses these settings to calculate a route between two points in a plan view.
By default, the route will go around the geometry of all visible model elements which have model geometry in the Route Analysis Zone.
The Route Analysis Zone, determined per view, is the space between these two horizontal planes:
a top plane vertically offset by AnalysisZoneTopOffset above the view's level and
a bottom plane vertically offset by AnalysisZoneBottomOffset ft above the view's level.
By default, the route will ignore the following elements:
elements outside of the crop region of the view;elements without any model geometry (annotations or view-specific elements);model lines (category OST_Lines);demolished elements;elements displayed in the underlay of the view.
There are a few ways to customize Route Analysis on a project-wide basis.
You can adjust the Route Analysis Zone using AnalysisZoneTopOffset
and AnalysisZoneBottomOffset.You can specify a set of model categories you would like ignored during route calculation.
To enable ignoring the set of specified categories, set EnableIgnoredCategoryIds to true.
To change the set of ignored categories, use SetIgnoredCategoryIds method
and IgnoreImports and IgnorePointClouds properties.
To query the set of ignored categories, use GetIgnoredCategoryIds.
Since:
2020